app/controllers/refugees_controller.rb

SELECT "refugees".* FROM "refugees"
---
  def list
    # return all refugees in an []
    @refugees = Refugee.all

SELECT  "refugees".* FROM "refugees" WHERE "refugees"."id" = $1 LIMIT 1  [["id", 0]]
---
  def read
    # return an individual refugee
    @refugee = Refugee.find(params[:id])